configuration/src/InformationRegisters/EmailAccountSettings/EmailAccountSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EmailAccountSettings</name>
  <resources>
    <name>AddSignatureForNewMessages</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NewMessageSignatureFormat</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </resources>
  <resources>
    <name>SignatureForNewMessagesPlainText</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>SignatureForNewMessagesFormattedDocument</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AddSignatureOnReplyForward</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignatureFormat</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignaturePlainText</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignatureFormattedDocument</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>DeletePersonalAccount</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>EmployeeResponsibleForProcessingEmails</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>EmployeeResponsibleForFoldersMaintenance</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>DeleteEmailsAfterSend</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PutEmailInBaseEmailFolder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NotUseInDefaultEmailClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IncludeUsernameInPresentation</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>MailHandlingInOtherMailClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>DateOfLastUse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>EmailAccount</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/EmailAccountSettings/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.AccessManagement

// Parameters:
//   Restriction - See AccessManagementOverridable.OnFillAccessRestriction.Restriction.
//
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	ValueAllowed(EmailAccount)
	|	OR ValueAllowed(EmailAccount.AccountOwner, EmptyRef AS FALSE)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region Internal

// 
//
// Parameters:
//  Account     - CatalogRef.EmailAccounts -
//  DateOfUse - Date -
//
Procedure UpdateTheAccountUsageDate(Account, DateOfUse = Undefined) Export
	
	SetPrivilegedMode(True);
	
	Block = New DataLock;
	LockItem = Block.Add("InformationRegister.EmailAccountSettings");
	LockItem.SetValue("EmailAccount", Account);
	
	RecordSet = InformationRegisters.EmailAccountSettings.CreateRecordSet();
	RecordSet.Filter.EmailAccount.Set(Account);
	
	If DateOfUse = Undefined Then
		DateOfUse = BegOfDay(CurrentSessionDate());
	EndIf;
	
	WritingRequired = False;
	
	BeginTransaction();
	Try
		
		Block.Lock();
		
		RecordSet.Read();
		
		If RecordSet.Count() > 0 Then
			
			If RecordSet[0].DateOfLastUse <> DateOfUse Then
				
				RecordSet[0].DateOfLastUse = DateOfUse;
				WritingRequired = True;
				
			EndIf;
			
		Else
			
			SetRecord = RecordSet.Add();
			SetRecord.DateOfLastUse   = DateOfUse;
			SetRecord.EmailAccount = Account;
			
			WritingRequired = True;
		
		EndIf;
		
		If WritingRequired Then
			RecordSet.Write();
		EndIf;
		
		CommitTransaction();
	
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

#EndRegion

#EndIf
